*** Inaccurate string *iteration*
- we can use unicode/utf8's =utf8.RuneCountInString(string)= to get the number of runes in string
- Iterating with a range
  s[i], prints the utf-8 representation of *the single byte* at index
  #+begin_src go :imports "fmt"
    s := "hllo"
    for i, r := range s {
        fmt.Printf("position %d: %c - %c\n", i, s[i], r)
    }
    fmt.Println(len(s))
  #+end_src

  #+RESULTS:
  : position 0: h - h
  : position 1:  - 
  : position 4: l - l
  : position 5: l - l
  : position 6: o - o
  : 7
- we can convert the string to a slice of rune, the indexes now will be proper positions
  #+begin_src go :imports "fmt"
    s := "heo"
    runes := []rune(s)
    for i, r := range runes {
        fmt.Printf("position %d: %c\n", i, r)
    }
  #+end_src

  #+RESULTS:
  : position 0: h
  : position 1: e
  : position 2: 
  : position 3: 
  : position 4: o
*** Misusing *Trim* function
- strings.TrimRight != strings.TrimSuffix
  strings.TrimLeft  != strings.TrimPrefix
- TrimRight: removes all the trailing runes contained in a given set
  #+begin_src go :imports '("fmt" "strings")
    fmt.Println(strings.TrimRight("123oxo", "xo"))
  #+end_src

  #+RESULTS:
  : 123

**** substring slicing, would index by bytes NOT runes
- convert it to *[]rune* first to index by runes, and then back to *string*
  #+begin_src go :imports "fmt"
    s1 := "Hllo, World!"
    fmt.Println(s1[:5])
    fmt.Println(string([]rune(s1)[:5]))
  #+end_src

  #+RESULTS:
  : Hl
  : Hllo
*** Panicking
- Once a panic is triggered, it continues up the call stack until either
  1) the current goroutine has returned
  2) or panic is caught with recover
- =recover()= is *only* useful inside a /defer/ function otherwise,
  the function would return *nil* and have no other effect.
- /defer/ functions are also executed when the surrounding function panics
- ~panic~ should be used sparingly
- ~panic~ is used to signal genuinely exceptional conditions
  1) such as a programmer error.
     - an invalid http code
     - received a nil instead of a pointer to struct (when receiving an interface)
     - received an already registered sql driver (in a map)
  2) when our application requires a dependency but fails to initialize it
     - regexp: Compile and MustCompile
- main.go
  #+begin_src go :imports '("fmt")
    func main() {
      defer func() {
         if r := recover(); r != nil {
           fmt.Println("recover", r)
         }
      }()
      f()
      fmt.Println("end main")
    }
    func f() {
      fmt.Println("a")
      panic("foo")
      fmt.Println("b")
    }
  #+end_src

  #+RESULTS:
  : a
  : recover foo
